a = set('hello')
print(a)        # {'h', 'l', 'o', 'e'}

b = set('hi there!')
print(b)        # {'t', 'e', 'r', '!', 'h', 'i', ' '}

#                                                   & (AND)
# Знайти загальні елементи для двох множин
c = a & b
print(c)        # {'h', 'e'}

#                                                   ^ (XOR)
# Знайти всі елементи окрім загальних
c = a ^ b
print(c)        # {'!', 'r', 'l', 'o', 't', 'i', ' '}

#                                                   | (OR)
# Об'єднання двох множин
c = a | b
print(c)        # {'h', 'e', 'o', 'i', 'l', ' ', 't', '!', 'r'}


# Множини необхідні коли необхідно знайти унікальні елементи
# Множини необхідні коли необхідно знайти загальні елементи

