# Exercise 1

# У нас є список показань заборгованостей з комунальних послуг 
# наприкінці місяця. Заборгованості можуть бути від'ємними — 
# у нас переплата, чи додатними, якщо необхідно сплатити за 
# рахунками. Напишіть функцію amount_payment, яка приймає на 
# вхід список платежів, підсумовує додатні значення та повертає 
# суму платежу наприкінці місяця.
# --------------------------------
# def amount_payment(payment):
# --------------------------------
def amount_payment(payment):

    sum = 0

    for bill in payment:
        
        if bill > 0:
            sum += bill
    
    return sum