# Всім відомо, що для доступу до кредитної картки банку потрібний 
# пін-код. Класично склалося, що це поєднання чотири цифри. Нам 
# необхідно вирішити наступне програмістське завдання. 
# Є підготовлений перелік пін-кодів. Напишіть функцію 
# is_valid_pin_codes, яка буде приймати як параметр список цих 
# пін-кодів — рядок з чотирьох цифр і повертати логічне 
# значення — валідний список чи ні. Переконайтеся, що серед цих 
# пін-кодів у списку не буде дублікатів, всі вони зберігаються 
# у вигляді рядків, їх довжина дорівнює 4 символам і містять 
# вони тільки цифри.

# Приклад аргументу для функції is_valid_pin_codes:
# ['1101', '9034', '0011']

# Якщо список відповідає всім поставленим умовам, функція 
# повертає логічне значення True. Якщо хоч одну з умов порушено, 
# повертається значення — False. Передбачити перевірку на 
# порожній список в аргументі функції та повернути при цьому 
# значення False.
#  ----------------------------------------
# def is_valid_pin_codes(pin_codes):
#  ----------------------------------------


# Умова 1 - Список повинен бути не пустим;
# Умова 2 - Не повинно бути дублікатів;
# Умова 3 - Повинні зберігатись у рядках
# Умова 4 - Довжина піну не повинна перевищувати 4 символи
# Умова 5 - Повинен містити тільки цифри

def is_valid_pin_codes(pin_codes):

    digitals = {'1', '2', '3', '4', '5', '6', '7', '8', '9', '0'}

    # Умова 1 - Список повинен бути не пустим;
    if pin_codes == list():
        return False
    
    unic_pin = set()
    
    for pin in pin_codes:

        # Умова 2 - Не повинно бути дублікатів;
        if pin not in unic_pin:
            unic_pin.add(pin)
        else:
            return False
        
        # Умова 3 - Повинні зберігатись у рядках
        if not isinstance(pin, str):
            return False
        
        # Умова 4 - Довжина піну не повинна перевищувати 4 символи
        if len(pin) > 4:
            return False
        
        # Умова 5 - Повинен містити тільки цифри
        for char in pin:
            if  char not in digitals:
                return False
            
    return True


pin_list = ['1101', '9034', '0011']
print(pin_list, ' is ', is_valid_pin_codes(pin_list))

pin_list = ['1101', '1101', '0011']
print(pin_list, ' is ', is_valid_pin_codes(pin_list))

pin_list = ['1101', 1101, '0011']
print(pin_list, ' is ', is_valid_pin_codes(pin_list))

pin_list = ['1101', 1101, '0b11']
print(pin_list, ' is ', is_valid_pin_codes(pin_list))

pin_list = []
print(pin_list, ' is ', is_valid_pin_codes(pin_list))