


print('---------- Приклад 1: " + " ----------')
#  Оператор " + " - додавання

a = 2 + 3
b = 4 + 5

print(a, b)
# 5 9

print('---------- Приклад 2: " - " ----------')
#  Оператор " - " - віднімання

a = 3 - 2
b = 5 - 5

print(a, b)
# 1 0

print('---------- Приклад 3: " * " ----------')
#  Оператор " * " - множення

a = 3 * 2
b = 5 * 5

print(a, b)
# 6 25

print('---------- Приклад 4: " / " ----------')
#  Оператор " / " - ділення

a = 6 / 2
b = 5 / 5

print(a, b)
# 3.0 1.0

print('---------- Приклад 5: " % " ----------')
#  Оператор " % " - залишок від ділення

a = 5 % 2
b = 5 % 5

print(a, b)
# 1 0

print('---------- Приклад 6: " // " ----------')
#  Оператор " // " - ділення без остачі

a = 5 // 2
b = 26 // 8

print(a, b)
# 2 3

print('---------- Приклад 7: " ** " ----------')
#  Оператор " ** " - піднесення до степені

a = 5 ** 2
b = 2 ** 6

print(a, b)
# 25 64