"""
__repr__

Цей метод приймає лише один аргумент (self звичайно) і повинен повертати рядок.
Якщо ви хочете виводити у випадках, коли застосунок повинен відобразити об'єкт, 
якусь корисну інформацію, ви можете модифікувати цей метод. 
Наприклад, клас точки на площині в Декартових координатах:
"""

class Point:
    
    def __init__(self, x, y):
        self.x = x
        self.y = y

    def __repr__(self):
        return f'Point({self.x}, {self.y})'
    

a = Point(1, 9)
print(a)            # Point(1, 9)