# Виконайте завдання, щоб визначити парне число чи ні, за допомогою 
# тернарного оператора.
# Програма встановлює значення змінної is_even у True або False, 
# залежно від того, чи є число в змінній num парним або непарним.
# 
# Підказка: перевірка на парність виконується порівнянням залишку від 
# поділу на 2 з 0 або 1. Нагадаємо, залишок від ділення можна отримати 
# після операції %
# ---------------------------------------------
# num = int(input("Enter an integer number: "))
# 
# is_even =
# ---------------------------------------------
num = int(input("Enter an integer number: "))

is_even = False if num % 2 else True
print(is_even)
