# Перепишіть попередній приклад, але використовуючи оператор break.

# Напишіть два подвійні цикли. У першому циклі while ми постійно запитуємо
# ціле число, а у другому за допомогою циклу for обчислюємо суму чисел 
# від 0 до введеного числа. 

# Вихід з першого циклу здійснюємо, якщо ввели число 0, за допомогою 
# оператора break.

# Тести використовують дві тестові послідовності чисел:

# 10, 13, 73, 0 і чекають на суму 2847
# 1, 2, 3, 4, 0 і чекають на суму 20
# -------------------------------------------------------
# sum = 0
# while True:
#     num = int(input("Enter integer (0 for output): "))
#     if
        
#     for i in range(num + 1):
#         sum = sum + i
# -------------------------------------------------------
sum = 0
while True:
    num = int(input("Enter integer (0 for output): "))
    if num == 0:
        break
        
    for i in range(num + 1):
        sum = sum + i
print('Output: ', sum)