"""
Як Python шукає атрибути (поля або методи) в об'єктах. 
Власне, це є MRO (Method Resolution Order). 

MRO у Python працює наступним чином:

1. Шукає атрибут серед атрибутів самого класу. Саме завдяки 
   цьому ви можете "перевизначати" батьківські атрибути.
2. Шукає атрибут у першого з батьків (той, що вказаний першим у списку батьків).
3. Шукає атрибут у наступного батька у списку батьків, доки такі є.
4. Шукає атрибут у батьках першого батька.
5. Повторює п.4 для всіх батьків.
6. Викликає виняток, що атрибут не знайдено.
"""

class A:
    x = 'I am A class'


class B:
    x = 'I am B class'
    y = 'I exist only in B'


class C(A,B):
    z = 'This exists only in C'


c = C()
print(c.z)  # This exists only in C
print(c.y)  # I exist only in B
print(c.x)  # I am A class