"""
 Метод __init__() — спеціальний метод конструктор, який автоматично 
 виконується під час створення кожного нового екземпляра на базі 
 класу Person. Ім'я методу починається і закінчується двома символами 
 підкреслення. Причина в тому, що так ми запобігаємо конфліктам імен 
 стандартних методів Python та методів ваших класів.
 
 Насправді метод __init__() є магічним методом і ми повернемося до 
 нього у наступному модулі

 Коли ми створюємо екземпляр Person, Python викликає метод __init__() 
 із класу Person. Ми передаємо у виклик Person("Boris", 34) ім'я "Boris" 
 та вік 34 в аргументах. Пам'ятаємо, що значення self буде передано 
 автоматично, явно передавати його не потрібно.
"""

class Person:


    def __init__(self, name, age):

        self.name = name
        self.age = age

    
    def greeting(self):
        return f'Hi {self.name}'
    

p = Person('Boris', 34)

print(p.name)           # Boris
print(p.age)            # 34
print(p.greeting())     # Hi Boris