# Кодування рядків ASCII, UTF-8, CP1251
# ASCII - для запису одного символу використовується один байт
# ASCII містить 256 символів.

# UTF-8 - для запису одного символу використовується від 1 до 4 байт
# UTF-8 містить 1 112 064 символів.

# UTF-8
# Щоб дізнатись якому елементу в UTF-8 відповідає символ
# ord       від order
print(ord('a')) # 97

# Щоб дізнатись який символ закодований під числом в UTF-8
# chr       від character
print(chr(128)) # 'd'

print('--------------------------------------------')
s = 'Привіт!'

utf8 = s.encode()
print(utf8) # b'\xd0\x9f\xd1\x80\xd0\xb8\xd0\xb2\xd1\x96\xd1\x82!'

utf16 = s.encode('utf-16')
print(utf16) # b'\xff\xfe\x1f\x04@\x048\x042\x04V\x04B\x04!\x00'

s_from_utf16 = utf16.decode('utf-16')
print(s_from_utf16) # Привіт!

