"""
Як ви знаєте, раніше телефони були з кнопками, та й зараз вони є 
подекуди у вжитку. Тоді текстові повідомлення набиралися за допомогою 
цифрових кнопок. Як інженери телефонів створили набір тексту? Рішення було 
в тому, що одна кнопка була асоційована одночасно з декількома літерами, а вибір 
залежав від кількості натискань на кнопку. Одноразове натискання призводило 
до появи першої літери у відповідному цій кнопці списку, наступні натискання 
змінювали її на наступну.

Символи, що відповідають кнопкам на телефонах
---------------------
| Button | Symbols  |
---------------------
|   1    |  .,?!:   |
|   2    |  A B C   |
|   3    |  D E F   |
|   4    |  G H I   | 
|   5    |  J K L   |
|   6    |  M N O   |
|   7    |  P Q R S |
|   8    |  T U V   |
|   9    |  W X Y Z |
|   0    |  Space   |
---------------------

Напишіть функцію sequence_buttons, що показує послідовність кнопок, 
яку необхідно натиснути, щоб на екрані телефону з'явився текст, введений користувачем.

Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція 
повинна повернути "4433555555666110966677755531111".

Вимоги:
- функція коректно обробляє малі та великі літери.
- функція ігнорує символи, що не входять до зазначеного списку
-------------------------
def sequence_buttons(string):

"""

def sequence_buttons(string):
    new_string = ''

    dict_symbols = {
        1: ['.', ',', '?', '!', ':'],
        2: ['A', 'B', 'C'],
        3: ['D', 'E', 'F'],
        4: ['G', 'H', 'I'],
        5: ['J', 'K', 'L'],
        6: ['M', 'N', 'O'],
        7: ['P', 'Q', 'R', 'S'],
        8: ['T', 'U', 'V'],
        9: ['W', 'X', 'Y', 'Z'],
        0: [' ']
    }
    
    for char in string:
        for button, letters in dict_symbols.items():
            
            if char.upper() in letters:
                amount = letters.index(char.upper()) + 1
                new_string += str(button)*amount
                break

    return new_string


print(sequence_buttons('Hello, World!'))