# Скласти програму, яка вводить з клавіатури тризначне число і 
# виводить на екран

# суму останньої та передостанньої цифри
# суму останньої та першої цифри.

num = int(input('Enter XXX number: '))

num_1 = (num // 100) % 10
num_2 = (num // 10) % 10
num_3 = (num // 1) % 10

sum_1 = num_2 + num_3
sum_2 = num_1 + num_3

# 345
# 345 // 100 --> 3 --> 3 % 10 --> 3
# 345 // 10 --> 34 --> 34 % 10 --> 4
# 345 // 1 --> 345 --> 345 % 10 --> 5

print(num_1, num_2, num_3)
print(f'Sum 1: {sum_1};')
print(f'Sum 2: {sum_2};')